src/Documents/ВозвратБилета/ВозвратБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ВозвратБилета</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<registerRecords>AccumulationRegister.ВозвратыКлиентов</registerRecords>
	<attributes>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<attributes>
		<name>МаскаБилета</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаШтрафа</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>Сборы</name>
		<type>
			<types>EnumRef.ОбщиеПеречисления</types>
		</type>
	</attributes>
	<attributes>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<attributes>
		<name>КассаБанковскийСчет</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>ШтрафВИнВ</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаШтрафаВВалюте</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидВозврата</types>
		</type>
	</attributes>
	<tabularSections>
		<name>ВозвратБилета</name>
		<attributes>
			<name>НомерБилета</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Покупатель</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>50</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Направление</name>
			<type>
				<types>CatalogRef.Направления</types>
			</type>
		</attributes>
		<attributes>
			<name>ДатаПродажи</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ДатаВылета</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГС</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Итого</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Тариф</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГН</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаОтАВК</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаСУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Билет</name>
			<type>
				<types>CatalogRef.Билет</types>
			</type>
		</attributes>
		<attributes>
			<name>PNR</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АВК</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
		<attributes>
			<name>Валюта</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВозвратыКлиентов/ВозвратыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВозвратыКлиентов</name>
	<resources>
		<name>СуммаВозвратаКлиенту</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>Штраф</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ДвижениеДенежныхСредств/ДвижениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ДвижениеДенежныхСредств</name>
	<resources>
		<name>Сумма</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>БанковскийСчетКасса</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ХозяйственнаяОперация</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСАгенствами/ВзаиморасчетыСАгенствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСАгенствами</name>
	<resources>
		<name>СуммаЗадолженностиАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Авиакомпания</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСКассирами/ВзаиморасчетыСКассирами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСКассирами</name>
	<resources>
		<name>СуммаЗадолженности</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Субагент</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Организация</name>
		<type>
			<types>CatalogRef.Организация</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидВозврата/ВидВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидВозврата</name>
	<enumValues>
		<name>ДобровольныйВозврат</name>
	</enumValues>
	<enumValues>
		<name>ВынужденныйВозврат</name>
	</enumValues>
</mdclass:Enum>

src/Enums/ХозОперации/ХозОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ХозОперации</name>
	<enumValues>
		<name>ОплатаПоставщику</name>
	</enumValues>
	<enumValues>
		<name>ПрочийРасход</name>
	</enumValues>
	<enumValues>
		<name>ПоступлениеОтКлиента</name>
	</enumValues>
	<enumValues>
		<name>ВозвратПокупателю</name>
	</enumValues>
	<enumValues>
		<name>Штраф</name>
	</enumValues>
	<enumValues>
		<name>ПродажаБилета</name>
	</enumValues>
	<enumValues>
		<name>Конвертация</name>
	</enumValues>
</mdclass:Enum>

src/Enums/ОбщиеПеречисления/ОбщиеПеречисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ОбщиеПеречисления</name>
	<enumValues>
		<name>СборыНеВозвращаются</name>
	</enumValues>
	<enumValues>
		<name>СборВозвращается</name>
	</enumValues>
	<enumValues>
		<name>СборыНеВозвращаются_2</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ВозвратБилета/ObjectModule.bsl
//TODO:Проверить проводки документа в Вынужденном статусе
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#Область РегВозвраты 
	Движения.ВозвратыКлиентов.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВозвратыКлиентов.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движение.Билет=СтрТаб.Билет;
		Движение.Покупатель=Покупатель;
		Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Движение.СуммаВозвратаКлиенту=СтрТаб.Итого-СуммаШтрафа;
		Движение.Штраф=0;
		ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда	
		Движение.СуммаВозвратаКлиенту=СтрТаб.Итого-СуммаШтрафа;
		Движение.Штраф=СуммаШтрафа;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
	КонецЦикла;
	#КонецОбласти
	#Область РегДДС
	//Возврат основной сумму покупателю
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ДвижениеДенежныхСредств.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Покупатель=Покупатель;
		Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Движение.Сумма=СтрТаб.Итого;	
		ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
		Движение.Сумма=СтрТаб.Итого-СуммаШтрафа;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
		Движение.ХозяйственнаяОперация=Перечисления.ХозОперации.ВозвратПокупателю;
		Движение.БанковскийСчетКасса=КассаБанковскийСчет;
	КонецЦикла;
	//-----------------------------------------------
	//Формирование движения по оприходованию штрафа
	Если ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ДвижениеДенежныхСредств.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движение.Покупатель=Покупатель;
		Если Сборы=Перечисления.ОбщиеПеречисления.СборВозвращается Тогда
			Движение.Сумма=СуммаШтрафа;
		ИначеЕсли Сборы=Перечисления.ОбщиеПеречисления.СборыНеВозвращаются Тогда
			Движение.Сумма=СуммаШтрафа+СтрТаб.АГС;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
		Движение.ХозяйственнаяОперация=Перечисления.ХозОперации.Штраф;
		Движение.БанковскийСчетКасса=КассаБанковскийСчет;
	КонецЦикла;
	КонецЕсли;
	//----------------------------------------------
	#КонецОбласти
	#Область Взаиморасчеты
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
		Движение.Период=Дата;
		Движение.Авиакомпания=СтрТаб.АВК;
		Движение.Билет=СтрТаб.Билет;
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.ВидОперации=Перечисления.ХозОперации.ВозвратПокупателю;
		Движение.СуммаЗадолженностиАГН=СтрТаб.СуммаОтАВК+СтрТаб.Тариф+СтрТаб.АГС;
		Движение.ВалютаВзаиморасчетов=Валюта;
	КонецЦикла;
	#КонецОбласти
	#Область ВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	//-------- Метод распределения суммы по ФИФО
	Если ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
	ТаблицаВзаиморасчетов=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(Покупатель,Дата,"ПроведениеДокумента");
	СуммаПлатежаЗначение=СуммаШтрафа;
	Остаток=0;
	Для каждого СтрТаб из ТаблицаВзаиморасчетов Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение-Остаток;
		Иначе
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=Валюта;
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
			Движение.Период=Дата;
			Движение.Субагент=Покупатель;
			КонецЕсли;
	КонецЦикла;
	ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Билет=СтрТаб.Билет;
		Движение.ВалютаВзаиморасчетов=СтрТаб.ВалютаВзаиморасчетов;
		Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
		Движение.Субагент=Покупатель;
		Движение.СуммаЗадолженности=СтрТаб.СуммаСУБ+СтрТаб.Тариф+СтрТаб.АГС;
		Движение.Период=Дата;
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
	Индекс=ПроверяемыеРеквизиты.Найти("СуммаШтрафа");
	ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры
